
/***********************************************************************************
* @file    dx12_commandAllocator.h
* @brief   DX12のコマンドアロケーター
* @details
*
* @author  Keigo Onari
* @date    2026/02/02
* @version v_1.0.0
*
* @copyright
* Copyright (c) 2024 Keigo Onari. All rights reserved.
*
* @note
************************************************************************************/

#pragma once
#ifndef DX12_COMMAND_ALLOCATOR_H_
#define DX12_COMMAND_ALLOCATOR_H_

/******************************************************************
* Include Headers
******************************************************************/
#include "../dx12_header.h"

/******************************************************************
* Macro Definitions
******************************************************************/


/******************************************************************
* Enumeration Definitions
******************************************************************/


/******************************************************************
* Structure Declarations
******************************************************************/



namespace RHI
{
	namespace DirectX12
	{
		class CommandAllocator
		{
		public:
			CommandAllocator();
			~CommandAllocator();


			/***********************************************************************************
			 * @brief コマンドアロケーターの生成
			 * @details core explanation
			 *
			 * @param[in] ID3D12Device* デバイス
			 * @return HRESULT 成功の有無
			 ************************************************************************************/
			HRESULT Create(ID3D12Device* device);

			/***********************************************************************************
			 * @brief コマンドアロケーターの取得
			 *
			 * @return ID3D12CommandAllocator* コマンドアロケーターのポインタ
			 ************************************************************************************/
			ID3D12CommandAllocator* Get(void);

			/***********************************************************************************
			 * @brief 解放関数
			 * @details ComPtrは解放しない
			 *
			 ************************************************************************************/
			void Release(void);

		private:
			Microsoft::WRL::ComPtr <ID3D12CommandAllocator> _pCmdAllocator = nullptr;
		};
	}
}

#endif // DX12_COMMAND_ALLOCATOR_H_

/************************************
* End of file
************************************/