
/***********************************************************************************
* @file    dx12_pipelineState.cpp
* @brief   DX12のPSO
* @details
*
* @author  Keigo Onari
* @date    2026/02/03
* @version v_1.0.0
*
* @copyright
* Copyright (c) 2024 Keigo Onari. All rights reserved.
*
* @note
************************************************************************************/


/******************************************************************
* Include Headers
******************************************************************/
#include "dx12_pipelineState.h"

/******************************************************************
* Macro Definitions
******************************************************************/


/******************************************************************
* Enumeration Definitions
******************************************************************/


/******************************************************************
* Structure Declarations
******************************************************************/

namespace RHI
{
	namespace DirectX12
	{
		PipelineState::PipelineState() {}
		PipelineState::~PipelineState() {}

		// ==============================================
		// フェンスの作成
		// ==============================================
		HRESULT PipelineState::Create(ID3D12Device* device)
		{
			return device->CreateGraphicsPipelineState(&_psoDesc, IID_PPV_ARGS(&_pPSO));
		}

		// ==============================================
		// 解放
		// ==============================================
		void PipelineState::Release(void)
		{
			// ComPtrのため明示的な解放は避ける
			//if (_pPSO.Get())_pPSO.Get()->Release();
		}
	}
}

/************************************
* End of file
************************************/