
/***********************************************************************************
* @file    dx12_swapChain.h
* @brief   DX12のスワップチェーン
* @details 
*
* @author  Keigo Onari
* @date    2026/02/02
* @version v_1.0.0
*
* @copyright
* Copyright (c) 2024 Keigo Onari. All rights reserved.
*
* @note    
************************************************************************************/

#pragma once
#ifndef DX12_SWAP_CHAIN_H_
#define DX12_SWAP_CHAIN_H_

/******************************************************************
* Include Headers
******************************************************************/
#include "../dx12_header.h"

/******************************************************************
* Macro Definitions
******************************************************************/


/******************************************************************
* Enumeration Definitions
******************************************************************/


/******************************************************************
* Structure Declarations
******************************************************************/



namespace RHI
{
    namespace DirectX12
    {
        class SwapChain
        {

            /******************************************************************
            * Internal Enumeration Declarations
            ******************************************************************/


            /******************************************************************
            * Internal Structure Declarations
            ******************************************************************/


        public:          /*---コンストラクタ・デストラクタ---*/
            SwapChain();
            ~SwapChain();


        public:          /*---クラスメソッド---*/


            /***********************************************************************************
             * @brief 生成関数
             * @details 
             *
             * @param[in] IDXGIFactory6* pDxgiFactory DXGIFactory6のポインタ
             * @param[in] ID3D12CommandQueue* pCmdQueue コマンドキュー
             * @param[in] HWND* hWnd ウインドウハンドルのポインタ
             * @param[in] UINT width 幅
             * @param[in] UINT height 高さ
             * @return HRESULT 成功の有無
             ************************************************************************************/
            HRESULT Create(IDXGIFactory6* pDxgiFactory, ID3D12CommandQueue* pCmdQueue, HWND* hWnd, UINT width, UINT height);

            /***********************************************************************************
             * @brief 取得関数
             *
             * @return IDXGISwapChain4* スワップチェーンのポインタ
             ************************************************************************************/
            IDXGISwapChain4* Get(void)const;

            /***********************************************************************************
             * @brief 解放関数
             * @details ComPtrは明示的な解放をしない
             * 
             ************************************************************************************/
            void Release(void);

        public:          /*---アクセッサー関数群---*/


        private:         /*---メンバ変数---*/

            Microsoft::WRL::ComPtr<IDXGISwapChain4> _pSwapChain ;

        };
    }
}


#endif // DX12_SWAP_CHAIN_H_

/************************************
* End of file
************************************/
