
/***********************************************************************************
* @file    spriteRenderer.h
* @brief   Renderer meshRenderer
* @details 
*
* @author  Keigo Onari
* @date    2026/09/13
* @version v_1.0.0
*
* @copyright
* Copyright (c) 2024 Keigo Onari. All rights reserved.
*
* @note    
************************************************************************************/

#pragma once
#ifndef SPRITE_RENDERER_H_
#define SPRITE_RENDERER_H_

/******************************************************************
* Include Headers
******************************************************************/
#include "../../RHI/Source/RenderHardwareInterface.h"

/******************************************************************
* Macro Definitions
******************************************************************/


/******************************************************************
* Enumeration Definitions
******************************************************************/


/******************************************************************
* Structure Declarations
******************************************************************/



namespace Renderer
{

    class SpriteRenderer
    {
        /******************************************************************
        * Internal Enumeration Declarations
        ******************************************************************/


        /******************************************************************
        * Internal Structure Declarations
        ******************************************************************/
        struct Sprite
        {

        };

    public:          /*---コンストラクタ・デストラクタ---*/
        SpriteRenderer() {}
        ~SpriteRenderer() {}


    public:          /*---クラスメソッド---*/


    public:          /*---アクセッサー関数群---*/


    private:         /*---メンバ変数---*/


    };

}


#endif // SPRITE_RENDERER_H_

/************************************
* End of file
************************************/
