#pragma once
#ifndef WINDOW_SYSTEM_H_
#define WINDOW_SYSTEM_H_

/******************************************************************
* Include Headers
******************************************************************/
#define NOMINMAX
#include <Windows.h>

/******************************************************************
* Macro Definitions
******************************************************************/


/******************************************************************
* Enumeration Definitions
******************************************************************/


/******************************************************************
* Structure Declarations
******************************************************************/

namespace Platform
{
	class WindowSystem
	{

		/******************************************************************
		* Internal Enumeration Declarations
		******************************************************************/


		/******************************************************************
		* Internal Structure Declarations
		******************************************************************/


	public:          /*---コンストラクタ---*/
		WindowSystem() {}
		~WindowSystem() {}


	public:          /*---クラスメソッド---*/


		/***********************************************************************************
		 * @brief 初期化
		 * @details 初期化
		 *
		 * @param[HWND*] hWnd ウインドウハンドル
		 * @param[HINSTANCE] hInstance アプリケーションハンドル
		 * @param[const TCHAR*] appName アプリ名
		 * @param[int] width ウインドウ幅
		 * @oaram[int] height ウインドウ高さ
		 * @param[int] 水平方向の位置の場所
		 * @param[int] 垂直方向の位置の場所
		 * @return bool 成功の有無
		 ************************************************************************************/
		bool InitWindow(HWND* hWnd, HINSTANCE hInstance, const TCHAR* appName, int width, int height, int x = 480, int y = 270);


		/***********************************************************************************
		 * @brief メッセージ処理
		 * @details ゲームループ内の繰り返し条件処理として呼ぶ
		 *
		 * @return bool 続けるか否か
		 ************************************************************************************/
		bool DispatchWindowMessage();

	public:          /*---アクセッサー関数群---*/


	private:         /*---メンバ変数---*/

	};
}

#endif // WINDOW_SYSTEM_H_