
/***********************************************************************************
* @file    Texture.h
* @brief   RHI Texture
* @details 
*
* @author  Keigo Onari
* @date    2025/1/13
* @version v_1.0.0
*
* @copyright
* Copyright (c) 2024 Keigo Onari. All rights reserved.
*
* @note    
************************************************************************************/

#pragma once
#ifndef RHI_TEXTURE_H_
#define RHI_TEXTURE_H_

/******************************************************************
* Include Headers
******************************************************************/
#include <string>
#include <vector>
#include "IObject.h"

/******************************************************************
* Macro Definitions
******************************************************************/


/******************************************************************
* Enumeration Definitions
******************************************************************/


/******************************************************************
* Structure Declarations
******************************************************************/



namespace RHI
{
    namespace ObjectInterface
    {
        class Texture : IObject
        {

            /******************************************************************
            * Internal Enumeration Declarations
            ******************************************************************/


            /******************************************************************
            * Internal Structure Declarations
            ******************************************************************/


        public:          /*---コンストラクタ・デストラクタ---*/
            Texture();
            ~Texture();


        public:          /*---クラスメソッド---*/

            bool Initialize()override { return true; }


        public:          /*---アクセッサー関数群---*/


        private:         /*---メンバ変数---*/

        };
    }
}


#endif // RHI_TEXTURE_H_

/************************************
* End of file
************************************/
