
/***********************************************************************************
* @file    TextureHandle.h
* @brief   テクスチャハンドル
* @details 
*
* @author  Keigo Onari
* @date    2026/04/25
* @version v_1.0.0
*
* @copyright
* Copyright (c) 2024 Keigo Onari. All rights reserved.
*
* @note    
************************************************************************************/

#pragma once
#ifndef TEXTURE_HANDLE_H_
#define TEXTURE_HANDLE_H_

/******************************************************************
* Include Headers
******************************************************************/
#include <cstdint>

/******************************************************************
* Macro Definitions
******************************************************************/


/******************************************************************
* Enumeration Definitions
******************************************************************/


/******************************************************************
* Structure Declarations
******************************************************************/



namespace RHI
{
    class TextureHandle
    {

        /******************************************************************
        * Internal Enumeration Declarations
        ******************************************************************/


        /******************************************************************
        * Internal Structure Declarations
        ******************************************************************/


    public:          /*---コンストラクタ・デストラクタ---*/
        TextureHandle() : _handle(-1) {};
        TextureHandle(UINT handle) { Make(handle); }
        ~TextureHandle() {};

    public:          /*---クラスメソッド---*/

        void Make(UINT handle)
        {
            this->_handle = handle;
        }

        UINT GetHandle(void)const
        {
            return _handle;
        }

    public:          /*---アクセッサー関数群---*/


    private:         /*---メンバ変数---*/

        UINT _handle;

    };
}


#endif // TEXTURE_HANDLE_H_

/************************************
* End of file
************************************/
