
/***********************************************************************************
* @file    hash.h
* @brief   ハッシュ化するクラス
* @details 
*
* @author  Keigo Onari
* @date    2026/02/02
* @version v_1.0.0
*
* @copyright
* Copyright (c) 2024 Keigo Onari. All rights reserved.
*
* @note    その他
************************************************************************************/

#pragma once
#ifndef HASH_H_
#define HASH_H_

/******************************************************************
* Include Headers
******************************************************************/
#include "random.h"

/******************************************************************
* Macro Definitions
******************************************************************/


/******************************************************************
* Enumeration Definitions
******************************************************************/


/******************************************************************
* Structure Declarations
******************************************************************/



namespace Core
{
    class Hash
    {

        /******************************************************************
        * Internal Enumeration Declarations
        ******************************************************************/


        /******************************************************************
        * Internal Structure Declarations
        ******************************************************************/


    public:          /*---コンストラクタ・デストラクタ---*/
        Hash();
        ~Hash();


    public:          /*---クラスメソッド---*/


        /***********************************************************************************
         * @brief 初期化関数
         * @details インスタンス後にこれを先に呼ぶ
         *
         * @param[in] const size_t ハッシュの最大値を設定(最小値は0固定)
         * @return bool 初期化成功の有無
         ************************************************************************************/
        bool Initialize(const size_t maxHashNum);


        /***********************************************************************************
         * @brief ハッシュ化(const char* -> uint32_t)
         *
         * @param[in] const char* name 名前
         * @param[in] const size_t nameSize 名前のサイズ
         * @return int ハッシュ値
         ************************************************************************************/
        int HashIntegerForName(const char* name, const size_t nameSize);


        /***********************************************************************************
         * @brief ハッシュ化(const char* -> uint32_t)
         *
         * @param[in] const char* name 名前
         * @param[in] const size_t nameSize 名前のサイズ
         * @return uint32_t ハッシュ値
         ************************************************************************************/
        uint32_t HashUIntegerForName(const char* name, const size_t nameSize);

        /***********************************************************************************
         * @brief ハッシュ化(int -> int)
         *
         * @param[in] int id ID
         * @return int ハッシュ値
         ************************************************************************************/
        int HashIntegerForInteger(int id);

        /***********************************************************************************
         * @brief ハッシュ化(id -> uint32_t)
         *
         * @param[in] int id ID
         * @return uint32_t ハッシュ値
         ************************************************************************************/
        uint32_t HashUIntegerForInteger(int id);

    public:          /*---アクセッサー関数群---*/


    private:         /*---メンバ変数---*/

        int _hashMax = 0;
        bool _initialized = false;

        void setSeed(const char* name, const size_t nameSize);
        void setSeed(int id);
    };
}


#endif // HASH_H_

/************************************
* End of file
************************************/
